; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v5)
             (pred_8 ?v9 ?v10)
             (pred_7 ?v2 ?v10)
             (pred_1 ?v13 ?v2 )
	     (pred_4 ?v2)
             (pred_10 ?v7)
             (pred_3 ?v9)
             (pred_12 ?v10)
             (pred_6 ?v2)
             (pred_5 ?v9)
             (pred_11 ?v2)
             (pred_2 ))



(:action op_2
:parameters (?v6 ?v3 ?v4 ?v11)
:precondition (and (pred_10 ?v6) (pred_10 ?v3) (pred_3 ?v4) (pred_12 ?v11)
          (pred_9 ?v6 ?v3) (pred_8 ?v4 ?v11)
                   (pred_7 ?v3 ?v11) (pred_4 ?v6) 
                   (pred_6 ?v3) (pred_5 ?v4))
:effect (and  (pred_11 ?v3) (not (pred_6 ?v3))))


(:action op_5
:parameters (?v6 ?v8)
:precondition (and (pred_10 ?v6) (pred_10 ?v8)
               (pred_4 ?v6) (pred_9 ?v6 ?v8) (pred_11 ?v8))
:effect (and (pred_4 ?v8) (not (pred_4 ?v6))))

(:action op_4
:parameters (?v6 ?v4)
:precondition (and (pred_10 ?v6) (pred_3 ?v4) 
                  (pred_4 ?v6) (pred_1 ?v4 ?v6) (pred_2 ))
:effect (and (pred_5 ?v4)
   (not (pred_1 ?v4 ?v6)) (not (pred_2 ))))


(:action op_1
:parameters (?v6 ?v12 ?v1)
:precondition (and (pred_10 ?v6) (pred_3 ?v12) (pred_3 ?v1)
                  (pred_4 ?v6) (pred_5 ?v1) (pred_1 ?v12 ?v6))
:effect (and (pred_5 ?v12) (pred_1 ?v1 ?v6)
        (not (pred_5 ?v1)) (not (pred_1 ?v12 ?v6))))

(:action op_3
:parameters (?v6 ?v4)
:precondition (and (pred_10 ?v6) (pred_3 ?v4) 
                  (pred_4 ?v6) (pred_5 ?v4))
:effect (and (pred_2 ) (pred_1 ?v4 ?v6) (not (pred_5 ?v4)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_28 obj_29 obj_31 obj_01 obj_22 obj_32 obj_02 obj_10 obj_09 obj_13 obj_23 obj_17 obj_18 obj_19 obj_05 obj_11 obj_04 obj_30 obj_15 obj_14 obj_27 obj_03 obj_24 obj_21 obj_25
    obj_08 obj_07 obj_26
    obj_12 obj_16 obj_20 obj_06
    )

    (:init
       (pred_2)

       (pred_10 obj_28)
       (pred_10 obj_29)
       (pred_10 obj_31)
       (pred_10 obj_01)
       (pred_10 obj_22)
       (pred_10 obj_32)
       (pred_10 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_23)
       (pred_10 obj_17)
       (pred_10 obj_18)
       (pred_10 obj_19)
       (pred_10 obj_05)
       (pred_10 obj_11)
       (pred_10 obj_04)
       (pred_10 obj_30)
       (pred_10 obj_15)
       (pred_10 obj_14)
       (pred_10 obj_27)
       (pred_10 obj_03)
       (pred_10 obj_24)
       (pred_10 obj_21)
       (pred_10 obj_25)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_26)
       (pred_3 obj_12)
       (pred_3 obj_16)
       (pred_3 obj_20)
       (pred_3 obj_06)

       (pred_9 obj_28 obj_32)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_29 obj_02)
       (pred_9 obj_29 obj_31)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_31 obj_10)
       (pred_9 obj_31 obj_01)
       (pred_9 obj_31 obj_29)
       (pred_9 obj_01 obj_09)
       (pred_9 obj_01 obj_22)
       (pred_9 obj_01 obj_31)
       (pred_9 obj_22 obj_13)
       (pred_9 obj_22 obj_01)
       (pred_9 obj_32 obj_23)
       (pred_9 obj_32 obj_02)
       (pred_9 obj_32 obj_28)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_02 obj_29)
       (pred_9 obj_02 obj_32)
       (pred_9 obj_10 obj_18)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_31)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_09 obj_01)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_13 obj_22)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_23 obj_11)
       (pred_9 obj_23 obj_17)
       (pred_9 obj_23 obj_32)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_18)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_23)
       (pred_9 obj_18 obj_30)
       (pred_9 obj_18 obj_19)
       (pred_9 obj_18 obj_10)
       (pred_9 obj_18 obj_17)
       (pred_9 obj_19 obj_15)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_05 obj_14)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_11 obj_27)
       (pred_9 obj_11 obj_04)
       (pred_9 obj_11 obj_23)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_04 obj_30)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_04 obj_11)
       (pred_9 obj_30 obj_24)
       (pred_9 obj_30 obj_15)
       (pred_9 obj_30 obj_18)
       (pred_9 obj_30 obj_04)
       (pred_9 obj_15 obj_21)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_15 obj_19)
       (pred_9 obj_15 obj_30)
       (pred_9 obj_14 obj_25)
       (pred_9 obj_14 obj_05)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_27 obj_03)
       (pred_9 obj_27 obj_11)
       (pred_9 obj_03 obj_24)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_03 obj_27)
       (pred_9 obj_24 obj_21)
       (pred_9 obj_24 obj_30)
       (pred_9 obj_24 obj_03)
       (pred_9 obj_21 obj_25)
       (pred_9 obj_21 obj_15)
       (pred_9 obj_21 obj_24)
       (pred_9 obj_25 obj_14)
       (pred_9 obj_25 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_11)
       (pred_6 obj_19)
       (pred_6 obj_04)
       (pred_7  obj_14 obj_08)
       (pred_7  obj_11 obj_07)
       (pred_7  obj_19 obj_26)
       (pred_7  obj_04 obj_26)
       (pred_11 obj_28)
       (pred_11 obj_29)
       (pred_11 obj_31)
       (pred_11 obj_01)
       (pred_11 obj_22)
       (pred_11 obj_32)
       (pred_11 obj_02)
       (pred_11 obj_10)
       (pred_11 obj_09)
       (pred_11 obj_13)
       (pred_11 obj_23)
       (pred_11 obj_17)
       (pred_11 obj_18)
       (pred_11 obj_05)
       (pred_11 obj_30)
       (pred_11 obj_15)
       (pred_11 obj_27)
       (pred_11 obj_03)
       (pred_11 obj_24)
       (pred_11 obj_21)
       (pred_11 obj_25)

       (pred_8  obj_12 obj_08)
       (pred_8  obj_16 obj_07)
       (pred_8  obj_20 obj_26)
       (pred_8  obj_06 obj_07)
       (pred_1 obj_12 obj_22)
       (pred_1 obj_16 obj_21)
       (pred_1 obj_20 obj_24)
       (pred_1 obj_06 obj_32)
       (pred_4 obj_17)
    )

    (:goal (and
       (pred_1 obj_12 obj_27)
       (pred_1 obj_16 obj_23)
       (pred_1 obj_20 obj_10)
       (pred_1 obj_06 obj_11)
    ))
(:constraints
  (always (not (pred_4 obj_01)))
)
)

; plan
1. (op_5 obj_17 obj_18)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_18)
   goals met: 0 of 4
2. (op_5 obj_18 obj_30)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_30)
   goals met: 0 of 4
3. (op_5 obj_30 obj_24)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_24)
   goals met: 0 of 4
4. (op_5 obj_24 obj_21)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_21)
   goals met: 0 of 4
5. (op_4 obj_21 obj_16)
   deleted: (pred_1 obj_16 obj_21) (pred_2)
   added: (pred_5 obj_16)
   goals met: 0 of 4
6. (op_5 obj_21 obj_24)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_24)
   goals met: 0 of 4
7. (op_5 obj_24 obj_03)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_03)
   goals met: 0 of 4
8. (op_5 obj_03 obj_27)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_27)
   goals met: 0 of 4
9. (op_2 obj_27 obj_11 obj_16 obj_07)
   deleted: (pred_6 obj_11)
   added: (pred_11 obj_11)
   goals met: 0 of 4
10. (op_3 obj_27 obj_16)
   deleted: (pred_5 obj_16)
   added: (pred_2) (pred_1 obj_16 obj_27)
   goals met: 0 of 4
11. (op_5 obj_27 obj_03)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_03)
   goals met: 0 of 4
12. (op_5 obj_03 obj_24)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_24)
   goals met: 0 of 4
13. (op_4 obj_24 obj_20)
   deleted: (pred_1 obj_20 obj_24) (pred_2)
   added: (pred_5 obj_20)
   goals met: 0 of 4
14. (op_5 obj_24 obj_03)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_03)
   goals met: 0 of 4
15. (op_5 obj_03 obj_27)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_27)
   goals met: 0 of 4
16. (op_5 obj_27 obj_11)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_11)
   goals met: 0 of 4
17. (op_5 obj_11 obj_23)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_23)
   goals met: 0 of 4
18. (op_3 obj_23 obj_20)
   deleted: (pred_5 obj_20)
   added: (pred_2) (pred_1 obj_20 obj_23)
   goals met: 0 of 4
19. (op_5 obj_23 obj_32)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_32)
   goals met: 0 of 4
20. (op_4 obj_32 obj_06)
   deleted: (pred_1 obj_06 obj_32) (pred_2)
   added: (pred_5 obj_06)
   goals met: 0 of 4
21. (op_5 obj_32 obj_23)
   deleted: (pred_4 obj_32)
   added: (pred_4 obj_23)
   goals met: 0 of 4
22. (op_5 obj_23 obj_11)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_11)
   goals met: 0 of 4
23. (op_3 obj_11 obj_06)
   deleted: (pred_5 obj_06)
   added: (pred_2) (pred_1 obj_06 obj_11)
   goals met: 1 of 4
24. (op_5 obj_11 obj_23)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_23)
   goals met: 1 of 4
25. (op_4 obj_23 obj_20)
   deleted: (pred_1 obj_20 obj_23) (pred_2)
   added: (pred_5 obj_20)
   goals met: 1 of 4
26. (op_5 obj_23 obj_17)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_17)
   goals met: 1 of 4
27. (op_5 obj_17 obj_18)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_18)
   goals met: 1 of 4
28. (op_5 obj_18 obj_10)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_10)
   goals met: 1 of 4
29. (op_3 obj_10 obj_20)
   deleted: (pred_5 obj_20)
   added: (pred_2) (pred_1 obj_20 obj_10)
   goals met: 2 of 4
30. (op_5 obj_10 obj_09)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_09)
   goals met: 2 of 4
31. (op_5 obj_09 obj_13)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_13)
   goals met: 2 of 4
32. (op_5 obj_13 obj_22)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_22)
   goals met: 2 of 4
33. (op_4 obj_22 obj_12)
   deleted: (pred_1 obj_12 obj_22) (pred_2)
   added: (pred_5 obj_12)
   goals met: 2 of 4
34. (op_5 obj_22 obj_13)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_13)
   goals met: 2 of 4
35. (op_5 obj_13 obj_09)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_09)
   goals met: 2 of 4
36. (op_5 obj_09 obj_10)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_10)
   goals met: 2 of 4
37. (op_5 obj_10 obj_02)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_02)
   goals met: 2 of 4
38. (op_5 obj_02 obj_32)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_32)
   goals met: 2 of 4
39. (op_5 obj_32 obj_23)
   deleted: (pred_4 obj_32)
   added: (pred_4 obj_23)
   goals met: 2 of 4
40. (op_5 obj_23 obj_11)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_11)
   goals met: 2 of 4
41. (op_5 obj_11 obj_27)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_27)
   goals met: 2 of 4
42. (op_1 obj_27 obj_16 obj_12)
   deleted: (pred_5 obj_12) (pred_1 obj_16 obj_27)
   added: (pred_5 obj_16) (pred_1 obj_12 obj_27)
   goals met: 3 of 4
43. (op_5 obj_27 obj_11)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_11)
   goals met: 3 of 4
44. (op_5 obj_11 obj_23)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_23)
   goals met: 3 of 4
45. (op_3 obj_23 obj_16)
   deleted: (pred_5 obj_16)
   added: (pred_2) (pred_1 obj_16 obj_23)
   goals met: 4 of 4
